In [7]:
import pandas as pd
import functions as func
import yaml

db_locations = func.import_yaml()

df = pd.read_csv(config['data_raw']['file3'])

df

,country,MostVisitedNumOfArrivals,MostVisitedDataYear,shareOfVisits
0,India,17914000,2019.0,1.795273
1,China,30402000,2020.0,3.046773
2,United States,45037000,2020.0,4.513437
3,Indonesia,4053000,2020.0,0.406176
4,Pakistan,966000,2012.0,0.096809
...,...,...,...,...
198,Marshall Islands,6100,2019.0,0.000611
199,San Marino,1904000,2019.0,0.190812
200,Palau,18400,2020.0,0.001844
201,Tuvalu,3600,2019.0,0.000361
202,Total,997842600,NaN,100.000000

In [20]:
#droping last row with total
df.drop(df.tail(1).index,inplace=True)

In [10]:
#remaning col
df = df.rename(columns={'country': 'country_name', 
                        "MostVisitedNumOfArrivals" :"num_arrivals",
                        "shareOfVisits": "share"}
              )

In [12]:
#drop missing values
df.dropna(inplace=True)

In [14]:
# droping index column and set country_name as index
df = df.set_index("country_name")

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 202 entries, India to Tuvalu
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   num_arrivals  202 non-null    int64
 1   share         202 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 4.7+ KB

In [24]:
#saving cleaned data frame
df.to_csv('../data/clean/tourism_data.csv')